package ru.naemys.movies.units;

import ru.naemys.movies.R;

public class MoviesUnit {
    public static final String TITLE_MOVIE_1 = "Побег из Шоушенка";
    public static final String DETAIL_MOVIE_1 = "Бухгалтер Энди Дюфрейн обвинён в убийстве " +
            "собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он" +
            "сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый," +
            "кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий" +
            "живым умом и доброй душой, находит подход как к заключённым, так и к охранникам," +
            "добиваясь их особого к себе расположения.";
    public static final int POSTER_RESOURCE_MOVIE_1 = R.drawable.the_shawshank_redemption;

    public static final String TITLE_MOVIE_2 = "Зеленая миля";
    public static final String DETAIL_MOVIE_2 = "Пол Эджкомб - начальник блока смертников в тюрьме" +
            "«Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к" +
            "месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако" +
            "гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных" +
            "обитателей блока.";
    public static final int POSTER_RESOURCE_MOVIE_2 = R.drawable.the_green_mile;

    public static final String TITLE_MOVIE_3 = "Форрест Гамп";
    public static final String DETAIL_MOVIE_3 = "От лица главного героя Форреста Гампа, слабоумного" +
            "безобидного человека с благородным и открытым сердцем, рассказывается история его" +
            "необыкновенной жизни.\n Фантастическим образом превращается он в известного футболиста, героя войны," +
            "преуспевающего бизнесмена. Он становится миллиардером, но остается таким же" +
            "бесхитростным, глупым и добрым. Форреста ждет постоянный успех во всем, а он любит" +
            "девочку, с которой дружил в детстве, но взаимность приходит слишком поздно.";
    public static final int POSTER_RESOURCE_MOVIE_3 = R.drawable.forrest_gump;

    public static final String TITLE_MOVIE_4 = "Список Шиндлера";
    public static final String DETAIL_MOVIE_4 = "Фильм рассказывает реальную историю загадочного" +
            "Оскара Шиндлера, члена нацистской партии, преуспевающего фабриканта, спасшего во время" +
            "Второй мировой войны почти 1200 евреев.";
    public static final int POSTER_RESOURCE_MOVIE_4 = R.drawable.schindlers_list;

    public static final String TITLE_MOVIE_5 = "1+1";
    public static final String DETAIL_MOVIE_5 = "Пострадав в результате несчастного случая, богатый" +
            "аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой" +
            "работы, молодого жителя предместья Дрисса, только что освободившегося из тюрьмы." +
            "Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в" +
            "размеренную жизнь аристократа дух приключений.";
    public static final int POSTER_RESOURCE_MOVIE_5 = R.drawable.intouchables;
}
